package define

import (
	"encoding/json"
	"muse-admin/pkg/errs"
)

// Region 地区信息
type Region struct {
	ID   int64  `json:"id"`
	Name string `json:"name"`
	City []City `json:"city"`
}

// City 城市信息
type City struct {
	ID   int64  `json:"id"`
	Name string `json:"name"`
}

// Province 省下面关联的所有市区信息
type Province struct {
	ProvinceID int64  `json:"provinceId"` // 省ID
	City       []City `json:"city"`       // 地区信息
}

// Regions 地区列表
var Regions = `[{"id":1,"name":"全国","city":[]},{"id":2,"name":"北京市","city":[{"id":20001,"name":"北京市"}]},{"id":3,"name":"天津市","city":[{"id":30001,"name":"天津市"}]},{"id":4,"name":"河北省","city":[{"id":40001,"name":"石家庄市"},{"id":40002,"name":"唐山市"},{"id":40003,"name":"秦皇岛市"},{"id":40004,"name":"邯郸市"},{"id":40005,"name":"邢台市"},{"id":40006,"name":"保定市"},{"id":40007,"name":"张家口市"},{"id":40008,"name":"承德市"},{"id":40009,"name":"沧州市"},{"id":40010,"name":"廊坊市"},{"id":40011,"name":"衡水市"},{"id":40012,"name":"雄安新区"}]},{"id":5,"name":"山西省","city":[{"id":50001,"name":"太原市"},{"id":50002,"name":"大同市"},{"id":50003,"name":"阳泉市"},{"id":50004,"name":"长治市"},{"id":50005,"name":"晋城市"},{"id":50006,"name":"朔州市"},{"id":50007,"name":"晋中市"},{"id":50008,"name":"运城市"},{"id":50009,"name":"忻州市"},{"id":50010,"name":"临汾市"},{"id":50011,"name":"吕梁市"}]},{"id":6,"name":"内蒙古自治区","city":[{"id":60001,"name":"呼和浩特市"},{"id":60002,"name":"包头市"},{"id":60003,"name":"乌海市"},{"id":60004,"name":"赤峰市"},{"id":60005,"name":"通辽市"},{"id":60006,"name":"鄂尔多斯市"},{"id":60007,"name":"呼伦贝尔市"},{"id":60008,"name":"巴彦淖尔市"},{"id":60009,"name":"乌兰察布市"},{"id":60010,"name":"兴安盟"},{"id":60011,"name":"锡林郭勒盟"},{"id":60012,"name":"阿拉善盟"}]},{"id":7,"name":"辽宁省","city":[{"id":70001,"name":"沈阳市"},{"id":70002,"name":"大连市"},{"id":70003,"name":"鞍山市"},{"id":70004,"name":"抚顺市"},{"id":70005,"name":"本溪市"},{"id":70006,"name":"丹东市"},{"id":70007,"name":"锦州市"},{"id":70008,"name":"营口市"},{"id":70009,"name":"阜新市"},{"id":70010,"name":"辽阳市"},{"id":70011,"name":"盘锦市"},{"id":70012,"name":"铁岭市"},{"id":70013,"name":"朝阳市"},{"id":70014,"name":"葫芦岛市"}]},{"id":8,"name":"吉林省","city":[{"id":80001,"name":"长春市"},{"id":80002,"name":"吉林市"},{"id":80003,"name":"四平市"},{"id":80004,"name":"辽源市"},{"id":80005,"name":"通化市"},{"id":80006,"name":"白山市"},{"id":80007,"name":"松原市"},{"id":80008,"name":"白城市"},{"id":80009,"name":"延边朝鲜族自治州"}]},{"id":9,"name":"黑龙江省","city":[{"id":90001,"name":"哈尔滨市"},{"id":90002,"name":"齐齐哈尔市"},{"id":90003,"name":"鸡西市"},{"id":90004,"name":"鹤岗市"},{"id":90005,"name":"双鸭山市"},{"id":90006,"name":"大庆市"},{"id":90007,"name":"伊春市"},{"id":90008,"name":"佳木斯市"},{"id":90009,"name":"七台河市"},{"id":90010,"name":"牡丹江市"},{"id":90011,"name":"黑河市"},{"id":90012,"name":"绥化市"},{"id":90013,"name":"大兴安岭地区"}]},{"id":10,"name":"上海市","city":[{"id":10011,"name":"上海市"}]},{"id":11,"name":"江苏省","city":[{"id":11001,"name":"南京市"},{"id":11002,"name":"无锡市"},{"id":11003,"name":"徐州市"},{"id":11004,"name":"常州市"},{"id":11005,"name":"苏州市"},{"id":11006,"name":"南通市"},{"id":11007,"name":"连云港市"},{"id":11008,"name":"淮安市"},{"id":11009,"name":"盐城市"},{"id":11010,"name":"扬州市"},{"id":11011,"name":"镇江市"},{"id":11012,"name":"泰州市"},{"id":11013,"name":"宿迁市"}]},{"id":12,"name":"浙江省","city":[{"id":12001,"name":"杭州市"},{"id":12002,"name":"宁波市"},{"id":12003,"name":"温州市"},{"id":12004,"name":"嘉兴市"},{"id":12005,"name":"湖州市"},{"id":12006,"name":"绍兴市"},{"id":12007,"name":"金华市"},{"id":12008,"name":"衢州市"},{"id":12009,"name":"舟山市"},{"id":12010,"name":"台州市"},{"id":12011,"name":"丽水市"}]},{"id":13,"name":"安徽省","city":[{"id":13001,"name":"合肥市"},{"id":13002,"name":"芜湖市"},{"id":13003,"name":"蚌埠市"},{"id":13004,"name":"淮南市"},{"id":13005,"name":"马鞍山市"},{"id":13006,"name":"淮北市"},{"id":13007,"name":"铜陵市"},{"id":13008,"name":"安庆市"},{"id":13009,"name":"黄山市"},{"id":13010,"name":"滁州市"},{"id":13011,"name":"阜阳市"},{"id":13012,"name":"宿州市"},{"id":13013,"name":"六安市"},{"id":13014,"name":"亳州市"},{"id":13015,"name":"池州市"},{"id":13016,"name":"宣城市"}]},{"id":14,"name":"福建省","city":[{"id":14001,"name":"福州市"},{"id":14002,"name":"厦门市"},{"id":14003,"name":"莆田市"},{"id":14004,"name":"三明市"},{"id":14005,"name":"泉州市"},{"id":14006,"name":"漳州市"},{"id":14007,"name":"南平市"},{"id":14008,"name":"龙岩市"},{"id":14009,"name":"宁德市"}]},{"id":15,"name":"江西省","city":[{"id":15001,"name":"南昌市"},{"id":15002,"name":"景德镇市"},{"id":15003,"name":"萍乡市"},{"id":15004,"name":"九江市"},{"id":15005,"name":"新余市"},{"id":15006,"name":"鹰潭市"},{"id":15007,"name":"赣州市"},{"id":15008,"name":"吉安市"},{"id":15009,"name":"宜春市"},{"id":15010,"name":"抚州市"},{"id":15011,"name":"上饶市"}]},{"id":16,"name":"山东省","city":[{"id":16001,"name":"济南市"},{"id":16002,"name":"青岛市"},{"id":16003,"name":"淄博市"},{"id":16004,"name":"枣庄市"},{"id":16005,"name":"东营市"},{"id":16006,"name":"烟台市"},{"id":16007,"name":"潍坊市"},{"id":16008,"name":"济宁市"},{"id":16009,"name":"泰安市"},{"id":16010,"name":"威海市"},{"id":16011,"name":"日照市"},{"id":16012,"name":"临沂市"},{"id":16013,"name":"德州市"},{"id":16014,"name":"聊城市"},{"id":16015,"name":"滨州市"},{"id":16016,"name":"菏泽市"}]},{"id":17,"name":"河南省","city":[{"id":17001,"name":"郑州市"},{"id":17002,"name":"开封市"},{"id":17003,"name":"洛阳市"},{"id":17004,"name":"平顶山市"},{"id":17005,"name":"安阳市"},{"id":17006,"name":"鹤壁市"},{"id":17007,"name":"新乡市"},{"id":17008,"name":"焦作市"},{"id":17009,"name":"濮阳市"},{"id":17010,"name":"许昌市"},{"id":17011,"name":"漯河市"},{"id":17012,"name":"三门峡市"},{"id":17013,"name":"南阳市"},{"id":17014,"name":"商丘市"},{"id":17015,"name":"信阳市"},{"id":17016,"name":"周口市"},{"id":17017,"name":"驻马店市"},{"id":17018,"name":"济源市"}]},{"id":18,"name":"湖北省","city":[{"id":18001,"name":"武汉市"},{"id":18002,"name":"黄石市"},{"id":18003,"name":"十堰市"},{"id":18004,"name":"宜昌市"},{"id":18005,"name":"襄阳市"},{"id":18006,"name":"鄂州市"},{"id":18007,"name":"荆门市"},{"id":18008,"name":"孝感市"},{"id":18009,"name":"荆州市"},{"id":18010,"name":"黄冈市"},{"id":18011,"name":"咸宁市"},{"id":18012,"name":"随州市"},{"id":18013,"name":"恩施土家族苗族自治州"},{"id":18014,"name":"仙桃市"},{"id":18015,"name":"潜江市"},{"id":18016,"name":"天门市"},{"id":18017,"name":"神农架林区"}]},{"id":19,"name":"湖南省","city":[{"id":19001,"name":"长沙市"},{"id":19002,"name":"株洲市"},{"id":19003,"name":"湘潭市"},{"id":19004,"name":"衡阳市"},{"id":19005,"name":"邵阳市"},{"id":19006,"name":"岳阳市"},{"id":19007,"name":"常德市"},{"id":19008,"name":"张家界市"},{"id":19009,"name":"益阳市"},{"id":19010,"name":"郴州市"},{"id":19011,"name":"永州市"},{"id":19012,"name":"怀化市"},{"id":19013,"name":"娄底市"},{"id":19014,"name":"湘西土家族苗族自治州"}]},{"id":20,"name":"广东省","city":[{"id":20011,"name":"广州市"},{"id":20012,"name":"韶关市"},{"id":20013,"name":"深圳市"},{"id":20014,"name":"珠海市"},{"id":20015,"name":"汕头市"},{"id":20016,"name":"佛山市"},{"id":20017,"name":"江门市"},{"id":20018,"name":"湛江市"},{"id":20019,"name":"茂名市"},{"id":20020,"name":"肇庆市"},{"id":20021,"name":"惠州市"},{"id":20022,"name":"梅州市"},{"id":20023,"name":"汕尾市"},{"id":20024,"name":"河源市"},{"id":20025,"name":"阳江市"},{"id":20026,"name":"清远市"},{"id":20027,"name":"东莞市"},{"id":20028,"name":"中山市"},{"id":20029,"name":"潮州市"},{"id":20030,"name":"揭阳市"},{"id":20031,"name":"云浮市"}]},{"id":21,"name":"广西壮族自治区","city":[{"id":21001,"name":"南宁市"},{"id":21002,"name":"柳州市"},{"id":21003,"name":"桂林市"},{"id":21004,"name":"梧州市"},{"id":21005,"name":"北海市"},{"id":21006,"name":"防城港市"},{"id":21007,"name":"钦州市"},{"id":21008,"name":"贵港市"},{"id":21009,"name":"玉林市"},{"id":21010,"name":"百色市"},{"id":21011,"name":"贺州市"},{"id":21012,"name":"河池市"},{"id":21013,"name":"来宾市"},{"id":21014,"name":"崇左市"}]},{"id":22,"name":"海南省","city":[{"id":22001,"name":"海口市"},{"id":22002,"name":"三亚市"},{"id":22003,"name":"三沙市"},{"id":22004,"name":"儋州市"},{"id":22005,"name":"五指山市"},{"id":22006,"name":"琼海市"},{"id":22007,"name":"文昌市"},{"id":22008,"name":"万宁市"},{"id":22009,"name":"东方市"},{"id":22010,"name":"定安县"},{"id":22011,"name":"屯昌县"},{"id":22012,"name":"澄迈县"},{"id":22013,"name":"临高县"},{"id":22014,"name":"白沙黎族自治县"},{"id":22015,"name":"昌江黎族自治县"},{"id":22016,"name":"乐东黎族自治县"},{"id":22017,"name":"陵水黎族自治县"},{"id":22018,"name":"保亭黎族苗族自治县"},{"id":22019,"name":"琼中黎族苗族自治县"}]},{"id":23,"name":"重庆市","city":[{"id":23001,"name":"重庆市"}]},{"id":24,"name":"四川省","city":[{"id":24001,"name":"成都市"},{"id":24002,"name":"自贡市"},{"id":24003,"name":"攀枝花市"},{"id":24004,"name":"泸州市"},{"id":24005,"name":"德阳市"},{"id":24006,"name":"绵阳市"},{"id":24007,"name":"广元市"},{"id":24008,"name":"遂宁市"},{"id":24009,"name":"内江市"},{"id":24010,"name":"乐山市"},{"id":24011,"name":"南充市"},{"id":24012,"name":"眉山市"},{"id":24013,"name":"宜宾市"},{"id":24014,"name":"广安市"},{"id":24015,"name":"达州市"},{"id":24016,"name":"雅安市"},{"id":24017,"name":"巴中市"},{"id":24018,"name":"资阳市"},{"id":24019,"name":"阿坝藏族羌族自治州"},{"id":24020,"name":"甘孜藏族自治州"},{"id":24021,"name":"凉山彝族自治州"}]},{"id":25,"name":"贵州省","city":[{"id":25001,"name":"贵阳市"},{"id":25002,"name":"六盘水市"},{"id":25003,"name":"遵义市"},{"id":25004,"name":"安顺市"},{"id":25005,"name":"毕节市"},{"id":25006,"name":"铜仁市"},{"id":25007,"name":"黔西南布依族苗族自治州"},{"id":25008,"name":"黔东南苗族侗族自治州"},{"id":25009,"name":"黔南布依族苗族自治州"}]},{"id":26,"name":"云南省","city":[{"id":26001,"name":"昆明市"},{"id":26002,"name":"曲靖市"},{"id":26003,"name":"玉溪市"},{"id":26004,"name":"保山市"},{"id":26005,"name":"昭通市"},{"id":26006,"name":"丽江市"},{"id":26007,"name":"普洱市"},{"id":26008,"name":"临沧市"},{"id":26009,"name":"楚雄彝族自治州"},{"id":26010,"name":"红河哈尼族彝族自治州"},{"id":26011,"name":"文山壮族苗族自治州"},{"id":26012,"name":"西双版纳傣族自治州"},{"id":26013,"name":"大理白族自治州"},{"id":26014,"name":"德宏傣族景颇族自治州"},{"id":26015,"name":"怒江傈僳族自治州"},{"id":26016,"name":"迪庆藏族自治州"}]},{"id":27,"name":"西藏自治区","city":[{"id":27001,"name":"拉萨市"},{"id":27002,"name":"日喀则市"},{"id":27003,"name":"昌都市"},{"id":27004,"name":"林芝市"},{"id":27005,"name":"山南市"},{"id":27006,"name":"那曲市"},{"id":27007,"name":"阿里地区"}]},{"id":28,"name":"陕西省","city":[{"id":28001,"name":"西安市"},{"id":28002,"name":"铜川市"},{"id":28003,"name":"宝鸡市"},{"id":28004,"name":"咸阳市"},{"id":28005,"name":"渭南市"},{"id":28006,"name":"延安市"},{"id":28007,"name":"汉中市"},{"id":28008,"name":"榆林市"},{"id":28009,"name":"安康市"},{"id":28010,"name":"商洛市"}]},{"id":29,"name":"甘肃省","city":[{"id":29001,"name":"兰州市"},{"id":29002,"name":"嘉峪关市"},{"id":29003,"name":"金昌市"},{"id":29004,"name":"白银市"},{"id":29005,"name":"天水市"},{"id":29006,"name":"武威市"},{"id":29007,"name":"张掖市"},{"id":29008,"name":"平凉市"},{"id":29009,"name":"酒泉市"},{"id":29010,"name":"庆阳市"},{"id":29011,"name":"定西市"},{"id":29012,"name":"陇南市"},{"id":29013,"name":"临夏回族自治州"},{"id":29014,"name":"甘南藏族自治州"}]},{"id":30,"name":"青海省","city":[{"id":30011,"name":"西宁市"},{"id":30012,"name":"海东市"},{"id":30013,"name":"海北藏族自治州"},{"id":30014,"name":"黄南藏族自治州"},{"id":30015,"name":"海南藏族自治州"},{"id":30016,"name":"果洛藏族自治州"},{"id":30017,"name":"玉树藏族自治州"},{"id":30018,"name":"海西蒙古族藏族自治州"}]},{"id":31,"name":"宁夏回族自治区","city":[{"id":31001,"name":"银川市"},{"id":31002,"name":"石嘴山市"},{"id":31003,"name":"吴忠市"},{"id":31004,"name":"固原市"},{"id":31005,"name":"中卫市"}]},{"id":32,"name":"新疆维吾尔族自治区","city":[{"id":32001,"name":"乌鲁木齐市"},{"id":32002,"name":"克拉玛依市"},{"id":32003,"name":"吐鲁番市"},{"id":32004,"name":"哈密市"},{"id":32005,"name":"昌吉回族自治州"},{"id":32006,"name":"博尔塔拉蒙古自治州"},{"id":32007,"name":"巴音郭楞蒙古自治州"},{"id":32008,"name":"阿克苏地区"},{"id":32009,"name":"克孜勒苏柯尔克孜自治州"},{"id":32010,"name":"喀什地区"},{"id":32011,"name":"和田地区"},{"id":32012,"name":"伊犁哈萨克自治州"},{"id":32013,"name":"塔城地区"},{"id":32014,"name":"阿勒泰地区"},{"id":32015,"name":"石河子市"},{"id":32016,"name":"阿拉尔市"},{"id":32017,"name":"图木舒克市"},{"id":32018,"name":"五家渠市"},{"id":32019,"name":"北屯市"},{"id":32020,"name":"铁门关市"},{"id":32021,"name":"双河市"},{"id":32022,"name":"可克达拉市"},{"id":32023,"name":"昆玉市"},{"id":32024,"name":"胡杨河市"},{"id":32025,"name":"新星市"},{"id":32026,"name":"白杨市"}]},{"id":33,"name":"香港特别行政区","city":[{"id":33001,"name":"香港岛"},{"id":33002,"name":"九龙"},{"id":33003,"name":"新界"}]},{"id":34,"name":"澳门特别行政区","city":[{"id":34001,"name":"澳门半岛"},{"id":34002,"name":"离岛"}]},{"id":35,"name":"台湾省","city":[{"id":35001,"name":"台北市"},{"id":35002,"name":"高雄市"},{"id":35003,"name":"台南市"},{"id":35004,"name":"台中市"},{"id":35005,"name":"金门县"},{"id":35006,"name":"南投县"},{"id":35007,"name":"基隆市"},{"id":35008,"name":"新竹市"},{"id":35009,"name":"嘉义市"},{"id":35010,"name":"新北市"},{"id":35011,"name":"宜兰县"},{"id":35012,"name":"新竹县"},{"id":35013,"name":"桃园市"},{"id":35014,"name":"苗栗县"},{"id":35015,"name":"彰化县"},{"id":35016,"name":"嘉义县"},{"id":35017,"name":"云林县"},{"id":35018,"name":"屏东县"},{"id":35019,"name":"台东县"},{"id":35020,"name":"花莲县"},{"id":35021,"name":"澎湖县"},{"id":35022,"name":"连江县"}]}]`

// GetRegionsList 获取地区列表
func GetRegionsList() ([]Region, error) {
	var region []Region
	err := json.Unmarshal([]byte(Regions), &region)
	if err != nil {
		return nil, errs.WithErr(err)
	}

	return region, nil
}

// InitRegions 初始化省市列表
func InitRegions() (resp []Region, res []Province, err error) {
	var regions []Region
	if err = json.Unmarshal([]byte(Regions), &regions); err != nil {
		return nil, nil, errs.WithErr(err)
	}
	for _, region := range regions {
		// 省列表
		resp = append(resp, Region{
			ID:   region.ID,
			Name: region.Name,
		})

		var city []City
		// 省下面有市级信息
		if len(region.City) > 0 {
			for _, c := range region.City {
				city = append(city, City{
					ID:   c.ID,
					Name: c.Name,
				})
			}
		}
		// 市列表
		res = append(res, Province{
			ProvinceID: region.ID,
			City:       city,
		})
		city = city[:0]
	}
	return resp, res, nil
}

// GetUserProvinceInfo 获取省市信息
func GetUserProvinceInfo(province, city int64) (string, string) {
	var provinceName, cityName string
	regions, _ := GetRegionsList()
	for _, region := range regions {
		// 获取省级信息
		if region.ID == province {
			provinceName = region.Name
			//  获取市级信息
			for _, cityRegion := range region.City {
				if cityRegion.ID == city {
					cityName = cityRegion.Name
				}
			}

		}
	}
	return provinceName, cityName
}
